---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitLengthParam
source: html/eae7e059-2d9b-09aa-7b4a-2703f4527f61.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitLengthParam { get; }
```